# U Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV..::..U Property
UV Class See Also
---
Gets the first coordinate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double U { get; }
```

Visual Basic
---
```text
Public ReadOnly Property U As Double
	Get
```

Visual C++
---
```text
public:
property double U {
	double get ();
}
```

# See Also
UV Class
Autodesk.Revit.DB Namespace